#+PROPERTY: header-args:haskell :exports both :results output 

* Test org-mode

#+begin_src haskell
1+1
#+end_src

#+RESULTS:
: 2

** XOR
Por pattern matching

#+begin_src haskell :session xor1
xor1 True True = False
xor1 True False = True
xor1 False True = True
xor1 False False = False
#+end_src

#+RESULTS:

#+begin_src haskell :session xor1
xor1 True True
#+end_src

#+RESULTS:
: *** Exception: <interactive>:43:1-24: Non-exhaustive patterns in function xor1



Mediante relacio lógica

#+begin_src haskell
xor x y = (x||y) && not (x && y)
xor True False
xor True True
#+end_src

#+RESULTS:
: 
: True
: False

Mediante desigualdad.

#+begin_src haskell
xor x y = x /= y
xor True False
xor True True
#+end_src

#+RESULTS:
: True
: False


** Elementos interiores de lista

#+begin_src haskell
interior xs = tail (init xs)

interior [3,4,5,8,9,6]
#+end_src

#+RESULTS:
: 
: Prelude> [4,5,8,9]


#+begin_src haskell
init [1,2,3]
#+end_src

#+RESULTS:
: [1,2]


#+begin_src haskell
tail [1,2,3]
#+end_src

#+RESULTS:
: [2,3]



* N elementos finales de lista

#+begin_src haskell
finales n xs = drop (length xs - n) xs

finales 3 [3,4,5,6]
#+end_src

#+RESULTS:


#+begin_src haskell
length [1,2,3] - 2
#+end_src

#+RESULTS:
: 1


#+begin_src haskell
drop 1 [1,2,3]
#+end_src

#+RESULTS:
: [2,3]


** Segmentos de una lista

#+begin_src haskell
segmento n m xs = drop (m-1) (take n xs)

segmento 6 3 [4,5,2,3,1,7,9,34]
#+end_src

#+RESULTS:
: 
: Prelude> [2,3,1,7]

m:3
n:4

#+begin_src haskell
take 2 [1,2,3,4,5,6,7,8]
#+end_src

#+RESULTS:
: [1,2]

#+begin_src haskell
drop 2 (take 4 [1,2,3,4,5])
#+end_src

#+RESULTS:
: [3,4]


